app/Http/Controllers/ChatController.php

select `messages`.`text`, `users`.`name` as `user_name`, `users`.`gravatar_img`, `messages`.`created_at`, `colors`.`name` as `user_color` from `messages` inner join `users` on `messages`.`user_id` = `users`.`id` inner join `colors` on `users`.`color_id` = `colors`.`id` order by `created_at` asc
select `id`, `name`, `role`, `token`, `isBan`, `isMute`, `gravatar_img` from `users` where `role` != 'admin'
select `token` from `users` where `id` = 5 limit 1
---
    public function index()
    {
        $messages = json_encode(DB::table('messages')
            ->join('users', 'messages.user_id', '=', 'users.id')
            ->join('colors', 'users.color_id', '=', 'colors.id')
            ->select('messages.text', 'users.name as user_name', 'users.gravatar_img', 'messages.created_at', 'colors.name as user_color')
            ->orderBy('created_at', 'asc')
            ->get());

        if (Auth::user()->isBanned()) {
            return view('ban');
        } else {
            if (Auth::user()->isAdmin()) {
                return view('chat')->with([
                    'user' => User::where('id', Auth::user()->id)->first(['token']),
                    'messages' => $messages,
                    'user' => Auth::user(),
                    'members' => json_encode(User::where('role', '!=', 'admin')->get(['id', 'name', 'role', 'isBan', 'isMute', 'gravatar_img']))
                ]);
            } else {
                return view('chat')->with([
                    'user' => User::where('id', Auth::user()->id)->first(['token']),
                    'messages' => $messages,
                    'user' => Auth::user()
                ]);